{
  "_name_or_path": "emilyalsentzer/Bio_ClinicalBERT",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ESI-1",
    "1": "ESI-2",
    "2": "ESI-3",
    "3": "ESI-4",
    "4": "ESI-5"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ESI-1": 0,
    "ESI-2": 1,
    "ESI-3": 2,
    "ESI-4": 3,
    "ESI-5": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.35.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
